
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПолучитьНастройки() Экспорт
	
	СтруктураВозврата = Новый Структура("АктивныйСерверRabbitMQ, ТочкаОбмена ");
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать АктивныйСерверRabbitMQ, ТочкаОбмена из РегистрСведений.rabbit_НастройкиПодсистемы";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	СтруктураВозврата.АктивныйСерверRabbitMQ = Выборка.АктивныйСерверRabbitMQ;
	СтруктураВозврата.ТочкаОбмена = Выборка.ТочкаОбмена;
	Возврат СтруктураВозврата;
	
КонецФункции
